public/marketing_and_friendship.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marketing is being a good friend</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Marketing is being a good friend</h1>
<p>
<a href="./index.html">Home</a>
</p>

<p>
Actually, it's MUCH more than that. Marketing itself is a career path for a reason. It's really complicated.
</p>

<p>
But.
</p>

<p>
I run a company, and I have to do marketing to get clients. It's a lot of work. This being said, my first three clients came from good friends of mine who simply knew someone who needed my skillset. There was very little if any "screening," white board coding interviews, or any of that. There appeared to be trust right at the start. My friend trusted me, so my client trusted me. This got my business off the ground, giving me enough momentum through re-signs and referrals to keep going. Want to get your business off the ground? Be a good friend. 
</p>


<p>
If we rewind to 2009, I was a certified personal trainer. A lot of my clients there became my friends. If you want someone to achieve their health and fitness goals, you really have to get to know them, which often led to me really liking and respecting them as a person. Accordingly, a lot of my clients from back then are still my friends to this day. When your clients are your friends, they're going to re-sign with you after the sessions they bought are used up. Want your clients to re-sign with you? Be a good friend. 
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: July 8 - July 8</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
